Revit 2026 API

# FabricationItemFileGetImage Method

---

Gets the image for the fabrication item file.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual Bitmap GetImage()
```
```vb
Public Overridable Function GetImage As Bitmap
```
```cpp
public:
virtual Bitmap^ GetImage()
```
```fsharp
abstract GetImage : unit -> Bitmap
override GetImage : unit -> Bitmap
```

#### Return Value

BitmapSystem.Drawing.Bitmap represents the fabrication item file image.  if there is no preview image.

#### Reference

FabricationItemFile Class

Autodesk.Revit.DB Namespace